/**
 * 평가 요소 관리
 * 코드별 질문 id 목록을 가짐
 */
export const EVALUATION_FACTORS: {
  [key: string]: {
    text: string;
    surveyIds: number[];
  };
} = {
  A: {
    text: "[간호대학,보건과학대학]공동체역량",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
  },
  B: {
    text: "[간호대학,보건과학대학]진로역량",
    surveyIds: [1, 2, 3, 4, 5, 6, 7],
  },
  C: {
    text: "[간호대학,보건과학대학]학업역량",
    surveyIds: [8, 9, 10, 11, 12, 13, 14, 15],
  },
  D: {
    text: "[미래융합대학]공동체역량",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
  },
  E: {
    text: "[미래융합대학]진로역량",
    surveyIds: [1, 2, 3, 4, 5, 6, 7],
  },
  F: {
    text: "[미래융합대학]학업역량",
    surveyIds: [8, 9, 10, 11, 12, 13, 14, 15],
  },
  G: {
    text: "Adaptability(환경적응역량)",
    surveyIds: [22, 23],
  },
  H: {
    text: "Confidence(자기주도역량)",
    surveyIds: [26, 27, 28],
  },
  I: {
    text: "Humanity(나눔과배려역량)",
    surveyIds: [19, 20, 21],
  },
  J: {
    text: "Mastery(전공역량)",
    surveyIds: [1, 2, 3, 4, 5, 6, 7],
  },
  K: {
    text: "Relationship(대인관계역량)",
    surveyIds: [16, 17, 18],
  },
  L: {
    text: "SW전공적합성",
    surveyIds: [1, 2, 3, 4, 5, 6, 7],
  },
  M: {
    text: "개인·사회적역량",
    surveyIds: [16, 17, 18, 26, 27, 28],
  },
  N: {
    text: "개인역량",
    surveyIds: [24, 25, 26, 27, 28],
  },
  O: {
    text: "계열(전공)적합성",
    surveyIds: [1, 2, 3, 4, 5],
  },
  P: {
    text: "계열적합성",
    surveyIds: [1, 2, 3, 4, 5],
  },
  Q: {
    text: "공감・정서조절역량",
    surveyIds: [19, 20, 21, 29, 30, 31, 32],
  },
  R: {
    text: "공감정서조절역량",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23],
  },
  S: {
    text: "공동체",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
  },
  T: {
    text: "공동체리더십역량",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
  },
  U: {
    text: "공동체역량",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
  },
  V: {
    text: "공동체역량(공동체의식)",
    surveyIds: [16, 17, 18],
  },
  W: {
    text: "공동체역량(나눔과배려)",
    surveyIds: [19, 20, 21],
  },
  X: {
    text: "공동체역량(사회경험경력)",
    surveyIds: [29, 30, 31, 32],
  },
  Y: {
    text: "공동체역량(학교생활충실성)",
    surveyIds: [22, 23],
  },
  Z: {
    text: "공동체역량[종합평가 Ⅱ]",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
  },
  AA: {
    text: "공동체의식",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
  },
  AB: {
    text: "공동체의식과협업능력",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
  },
  AC: {
    text: "공동체의식및협동능력",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
  },
  AD: {
    text: "교과활동",
    surveyIds: [1, 2, 3, 4, 8, 9],
  },
  AE: {
    text: "교직소양",
    surveyIds: [36, 37, 38],
  },
  AF: {
    text: "교직수행역량",
    surveyIds: [36, 37, 38],
  },
  AG: {
    text: "교직역량",
    surveyIds: [36, 37, 38],
  },
  AH: {
    text: "교직원인성",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
  },
  AI: {
    text: "교직원인적성",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 36, 37, 38],
  },
  AJ: {
    text: "교직인·적성",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 36, 37, 38],
  },
  AK: {
    text: "교직인성",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24],
  },
  AL: {
    text: "교직인성(공감및소통능력)",
    surveyIds: [16, 17, 18],
  },
  AM: {
    text: "교직인성(나눔과배려)",
    surveyIds: [19, 20, 21],
  },
  AN: {
    text: "교직적합성",
    surveyIds: [36, 37, 38],
  },
  AO: {
    text: "교직적합성및잠재력",
    surveyIds: [36, 37, 38],
  },
  AP: {
    text: "교직적합성및잠재력(교직적합성)",
    surveyIds: [36, 37, 38],
  },
  AQ: {
    text: "교직적합성및잠재력(리더십및자기주도성)",
    surveyIds: [24, 25, 26, 27, 28],
  },
  AR: {
    text: "기본품성",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23],
  },
  AS: {
    text: "기초역량",
    surveyIds: [10, 11, 12, 13, 14, 15],
  },
  AT: {
    text: "기초학습능력",
    surveyIds: [10, 11, 12, 13, 14, 15],
  },
  AU: {
    text: "기초학업능력",
    surveyIds: [10, 11, 12, 13, 14, 15],
  },
  AV: {
    text: "기초학업역량",
    surveyIds: [10, 11, 12, 13, 14, 15],
  },
  AW: {
    text: "나우리역량",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
  },
  AX: {
    text: "다문화・글로벌역량",
    surveyIds: [39, 40],
  },
  AY: {
    text: "다문화글로벌역량",
    surveyIds: [39, 40],
  },
  AZ: {
    text: "대인관계.품성",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
  },
  BA: {
    text: "덕성역량",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23],
  },
  BB: {
    text: "도전정신",
    surveyIds: [33, 34, 35],
  },
  BC: {
    text: "리더십",
    surveyIds: [24, 25],
  },
  BD: {
    text: "발전가능성",
    surveyIds: [16, 17, 18, 22, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35],
  },
  BE: {
    text: "발전가능성(경험의다양성,자기주도성)",
    surveyIds: [26, 27, 28, 29, 30, 31, 32],
  },
  BF: {
    text: "발전가능성(다양한경험과창의적문제해결력)",
    surveyIds: [29, 30, 31, 32, 33, 34, 35],
  },
  BG: {
    text: "발전가능성(실천능력)",
    surveyIds: [32],
  },
  BH: {
    text: "발전가능성(자기주도성)",
    surveyIds: [26, 27, 28],
  },
  BI: {
    text: "발전가능성(자기주도성,도전정신)",
    surveyIds: [26, 27, 28],
  },
  BJ: {
    text: "발전가능성및자기주도성",
    surveyIds: [16, 17, 18, 22, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35],
  },
  BK: {
    text: "발전역량",
    surveyIds: [26, 27, 28, 34, 35],
  },
  BL: {
    text: "변화리더쉽",
    surveyIds: [24, 25, 33, 34, 35],
  },
  BM: {
    text: "비교과활동",
    surveyIds: [6, 7, 13, 14, 15, 29, 30, 31, 32],
  },
  BN: {
    text: "비판적사고",
    surveyIds: [41],
  },
  BO: {
    text: "사회성",
    surveyIds: [16, 17, 18],
  },
  BP: {
    text: "사회역량",
    surveyIds: [22, 23, 16, 17, 18],
  },
  BQ: {
    text: "성실성",
    surveyIds: [22, 23, 32, 34],
  },
  BR: {
    text: "성장가능성",
    surveyIds: [26, 27, 28, 29, 30, 31, 32],
  },
  BS: {
    text: "성장가능성(지적호기심및탐구능력)",
    surveyIds: [13, 14, 15],
  },
  BT: {
    text: "성장가능성(학업태도및학업의지)",
    surveyIds: [24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35],
  },
  BU: {
    text: "성장및발전가능성",
    surveyIds: [24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35],
  },
  BV: {
    text: "성장잠재력",
    surveyIds: [24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35],
  },
  BW: {
    text: "성장잠재력및발전가능성",
    surveyIds: [24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35],
  },
  BX: {
    text: "성취도",
    surveyIds: [8, 9],
  },
  BY: {
    text: "성취역량평가(비판적사고,창의적사고,자기주도)",
    surveyIds: [26, 27, 28, 33, 34, 35],
  },
  BZ: {
    text: "성취역량평가(소통협업)",
    surveyIds: [16, 17, 18],
  },
  CA: {
    text: "예비초등교사로서의자질",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 36, 37, 38],
  },
  CB: {
    text: "의사표현력",
    surveyIds: [42],
  },
  CC: {
    text: "이공계소양.재능",
    surveyIds: [1, 2, 3, 4, 5, 6, 7, 8, 9],
  },
  CD: {
    text: "인성",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
  },
  CE: {
    text: "인성(공동체의식)",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
  },
  CF: {
    text: "인성(사회성)",
    surveyIds: [16, 17, 18, 19, 20, 21],
  },
  CG: {
    text: "인성(성실성)",
    surveyIds: [22, 23],
  },
  CH: {
    text: "인성(성실성,공동체의식)",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
  },
  CI: {
    text: "인성(협업·소통능력)",
    surveyIds: [16, 17, 18],
  },
  CJ: {
    text: "인성,공동체기여도",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
  },
  CK: {
    text: "인성․공동체기여도",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
  },
  CL: {
    text: "인성・가치관",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
  },
  CM: {
    text: "인성및가지관",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
  },
  CN: {
    text: "인성및공동체역량",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
  },
  CO: {
    text: "인성및공동체의식",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
  },
  CP: {
    text: "인성및공동체의식(공동체의식)",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
  },
  CQ: {
    text: "인성및공동체의식(인성및품성)",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
  },
  CR: {
    text: "인성및발전가능성",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
  },
  CS: {
    text: "인성및발전가능성(공동체역량)(도덕성및성실성))",
    surveyIds: [16, 17, 18, 19, 20, 21],
  },
  CT: {
    text: "인성및발전가능성(공동체역량)(협업과소통능력))",
    surveyIds: [22, 23, 24, 25],
  },
  CU: {
    text: "인성및발전가능성(도덕성및성실성)",
    surveyIds: [16, 17, 18, 19, 20, 21],
  },
  CV: {
    text: "인성및발전가능성(성실성및봉사정신)",
    surveyIds: [22, 23, 24, 25],
  },
  CW: {
    text: "인성및발전가능성(협력소통능력)",
    surveyIds: [22, 23, 24, 25],
  },
  CX: {
    text: "인성및발전가능성(협업과소통능력)",
    surveyIds: [22, 23, 24, 25],
  },
  CY: {
    text: "인성및사회성",
    surveyIds: [16, 17, 18],
  },
  CZ: {
    text: "인성및사회성(성실성및봉사정신)",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
  },
  DA: {
    text: "인성및영성",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
  },
  DB: {
    text: "인성및잠재성",
    surveyIds: [26, 27, 28],
  },
  DC: {
    text: "인성역량",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
  },
  DD: {
    text: "인성영역",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 26],
  },
  DE: {
    text: "인성적자질",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 27],
  },
  DF: {
    text: "인재상적합도",
    surveyIds: [26, 27, 28, 33, 34, 35],
  },
  DG: {
    text: "인정및영성",
    surveyIds: [],
  },
  DH: {
    text: "자기개발역량",
    surveyIds: [
      1, 2, 3, 4, 5, 6, 7, 13, 14, 15, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35,
    ],
  },
  DI: {
    text: "자기계발역량",
    surveyIds: [
      1, 2, 3, 4, 5, 6, 7, 13, 14, 15, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35,
    ],
  },
  DJ: {
    text: "자기계발역량(자기주도성)",
    surveyIds: [
      1, 2, 3, 4, 5, 6, 7, 13, 14, 15, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35,
    ],
  },
  DK: {
    text: "자기계발의지",
    surveyIds: [
      1, 2, 3, 4, 5, 6, 7, 13, 14, 15, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35,
    ],
  },
  DL: {
    text: "자기관리역량",
    surveyIds: [10, 11, 12, 32],
  },
  DM: {
    text: "자기및타인이해",
    surveyIds: [16, 17, 18],
  },
  DN: {
    text: "자기주도성",
    surveyIds: [26, 27, 28],
  },
  DO: {
    text: "자기주도성(적극성)",
    surveyIds: [26, 27, 28],
  },
  DP: {
    text: "자기주도성(추진력)",
    surveyIds: [33, 34, 35],
  },
  DQ: {
    text: "자기주도성및도전정신",
    surveyIds: [26, 27, 28, 33, 34, 35],
  },
  DR: {
    text: "잠재능력",
    surveyIds: [22, 26, 27, 28, 34, 35],
  },
  DS: {
    text: "잠재력",
    surveyIds: [22, 26, 27, 28, 34, 35],
  },
  DT: {
    text: "잠재역량",
    surveyIds: [22, 26, 27, 28, 34, 35],
  },
  DU: {
    text: "잠재역량(전공관련 활동및탐색,전공관련 교과이수,자기주도성)",
    surveyIds: [22, 26, 27, 28, 34, 35],
  },
  DV: {
    text: "재직점수",
    surveyIds: [],
  },
  DW: {
    text: "적극성",
    surveyIds: [26, 27, 28],
  },
  DX: {
    text: "전공",
    surveyIds: [1, 2, 3, 4, 5, 6, 7],
  },
  DY: {
    text: "전공(계열)적합성",
    surveyIds: [1, 2, 3, 4, 5, 6, 9],
  },
  DZ: {
    text: "전공관심도",
    surveyIds: [1, 2, 3, 4, 5, 6, 10],
  },
  EA: {
    text: "전공능력",
    surveyIds: [1, 2, 3, 4, 5, 6, 11],
  },
  EB: {
    text: "전공능력(성장가능성)",
    surveyIds: [29, 30, 31],
  },
  EC: {
    text: "전공능력(전공적합성)",
    surveyIds: [1, 2, 3, 4, 5, 6, 11],
  },
  ED: {
    text: "전공수학능력",
    surveyIds: [1, 2, 3, 4, 5, 6, 12],
  },
  EE: {
    text: "전공역량",
    surveyIds: [1, 2, 3, 4, 5, 6, 13],
  },
  EF: {
    text: "전공일치도",
    surveyIds: [1, 2, 3, 4, 5, 6, 8],
  },
  EG: {
    text: "전공잠재력",
    surveyIds: [1, 2, 3, 4, 5, 6, 14],
  },
  EH: {
    text: "전공적합성",
    surveyIds: [1, 2, 3, 4, 5, 6, 7],
  },
  EI: {
    text: "전공적합성(성장잠재력및발전가능성)",
    surveyIds: [1, 2, 3, 4, 5, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35],
  },
  EJ: {
    text: "전공적합성(전공관련이해도)",
    surveyIds: [1, 2, 3, 4, 5, 6, 7],
  },
  EK: {
    text: "전공적합성(전공관련활동경험)",
    surveyIds: [1, 2, 3, 4, 5, 6, 7],
  },
  EL: {
    text: "전공적합성(전공관심도)",
    surveyIds: [1, 2, 3, 4, 5, 6, 7],
  },
  EM: {
    text: "전공적합성(전공수학능력)",
    surveyIds: [1, 2, 3, 4, 5, 6, 7],
  },
  EN: {
    text: "전공적합성(전공잠재성)",
    surveyIds: [1, 2, 3, 4, 5, 6, 7],
  },
  EO: {
    text: "전공적합성(전공적성)",
    surveyIds: [1, 2, 3, 4, 5, 6, 7],
  },
  EP: {
    text: "전공적합성(전공활동성)",
    surveyIds: [1, 2, 3, 4, 5, 6, 7],
  },
  EQ: {
    text: "전공적합성(진로역량)(진로의지)",
    surveyIds: [1, 2, 3, 4, 5, 6, 7],
  },
  ER: {
    text: "전공적합성(진로역량)(진로탐색)",
    surveyIds: [1, 2, 3, 4, 5, 6, 7],
  },
  ES: {
    text: "전공적합성(진로역량)(창업활동)",
    surveyIds: [1, 2, 3, 4, 5, 6, 7],
  },
  ET: {
    text: "전공적합성(진로의지)",
    surveyIds: [1, 2, 3, 4, 5, 6, 7],
  },
  EU: {
    text: "전공적합성(진로탐색활동과경험)",
    surveyIds: [1, 2, 3, 4, 5, 6, 7],
  },
  EV: {
    text: "전공적합성(학업역량)",
    surveyIds: [1, 2, 3, 4, 5, 6, 7],
  },
  EW: {
    text: "전공적합성(학업역량,전공적성)",
    surveyIds: [1, 2, 3, 4, 5, 6, 7],
  },
  EX: {
    text: "전공적합성및잠재역량",
    surveyIds: [1, 2, 3, 4, 5, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35],
  },
  EY: {
    text: "전공전공(계열)적합성",
    surveyIds: [1, 2, 3, 4, 5, 6, 7],
  },
  EZ: {
    text: "전공준비도",
    surveyIds: [1, 2, 3, 4, 5, 6, 7],
  },
  FA: {
    text: "전문성",
    surveyIds: [1, 2, 3, 4, 5, 6, 7],
  },
  FB: {
    text: "졸업후진로계획",
    surveyIds: [1, 2, 3, 4, 5, 6, 7],
  },
  FC: {
    text: "종합",
    surveyIds: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
  },
  FD: {
    text: "종합역량평가",
    surveyIds: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
  },
  FE: {
    text: "종합점수",
    surveyIds: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
  },
  FF: {
    text: "종합평가",
    surveyIds: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14],
  },
  FG: {
    text: "지성영역",
    surveyIds: [13, 14, 15],
  },
  FH: {
    text: "지원동기",
    surveyIds: [6],
  },
  FI: {
    text: "지적역량",
    surveyIds: [13, 14, 15],
  },
  FJ: {
    text: "직무역량",
    surveyIds: [13, 14, 15],
  },
  FK: {
    text: "진로",
    surveyIds: [1, 2, 3, 4, 5, 6, 7],
  },
  FL: {
    text: "진로및학업역량",
    surveyIds: [1, 2, 3, 4, 5, 6, 7],
  },
  FM: {
    text: "진로역량",
    surveyIds: [1, 2, 3, 4, 5, 6, 7],
  },
  FN: {
    text: "진로역량(계열성취도)",
    surveyIds: [1, 2, 3, 4, 5, 6, 7],
  },
  FO: {
    text: "진로역량(계열적합성)",
    surveyIds: [1, 2, 3, 4, 5, 6, 7],
  },
  FP: {
    text: "진로역량(자기개발노력)",
    surveyIds: [1, 2, 3, 4, 5, 6, 7],
  },
  FQ: {
    text: "진로역량(전공(계열)관련교과성취도)",
    surveyIds: [1, 2, 3, 4, 5, 6, 7],
  },
  FR: {
    text: "진로역량(전공(계열)관련교과이수정도)",
    surveyIds: [1, 2, 3, 4, 5, 6, 7],
  },
  FS: {
    text: "진로역량(진로탐색활동및노력)",
    surveyIds: [1, 2, 3, 4, 5, 6, 7],
  },
  FT: {
    text: "진로연계성",
    surveyIds: [1, 2, 3, 4, 5, 6, 7],
  },
  FU: {
    text: "진로탐구역량",
    surveyIds: [1, 2, 3, 4, 5, 6, 7],
  },
  FV: {
    text: "진학동기및목표",
    surveyIds: [1, 2, 3, 4, 5, 6, 7],
  },
  FW: {
    text: "창의성",
    surveyIds: [33, 34, 35],
  },
  FX: {
    text: "창의영역",
    surveyIds: [33, 34, 35],
  },
  FY: {
    text: "창의융합역량",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
  },
  FZ: {
    text: "창의적지식활용역량",
    surveyIds: [33, 34, 35],
  },
  GA: {
    text: "창의적체험활동",
    surveyIds: [33, 34, 35],
  },
  GB: {
    text: "창의적체험활동/행동특성기준",
    surveyIds: [33, 34, 35],
  },
  GC: {
    text: "창의적탐구역량",
    surveyIds: [33, 34, 35],
  },
  GD: {
    text: "최종서류평가",
    surveyIds: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
  },
  GE: {
    text: "탐구역량",
    surveyIds: [13, 14, 15],
  },
  GF: {
    text: "학교생활충실도",
    surveyIds: [10, 11, 12, 13, 14, 15, 22, 23],
  },
  GG: {
    text: "학교활동의우수성",
    surveyIds: [
      10, 11, 12, 13, 14, 15, 1, 2, 3, 4, 5, 6, 7, 33, 34, 35, 16, 17, 18, 24,
      25, 19, 20, 21,
    ],
  },
  GH: {
    text: "학문적역량",
    surveyIds: [8, 9, 10, 11, 12, 13, 14, 15],
  },
  GI: {
    text: "학생부(교과)",
    surveyIds: [1, 2, 3, 4, 8, 9],
  },
  GJ: {
    text: "학생부(비교과)",
    surveyIds: [6, 7, 13, 14, 15, 29, 30, 31, 32],
  },
  GK: {
    text: "학업",
    surveyIds: [8, 9, 10, 11, 12, 13, 14, 15],
  },
  GL: {
    text: "학업능력",
    surveyIds: [8, 9, 10, 11, 12, 13, 14, 15],
  },
  GM: {
    text: "학업성취",
    surveyIds: [8, 9, 10, 11, 12, 13, 14, 15],
  },
  GN: {
    text: "학업성취도",
    surveyIds: [8, 9, 10, 11, 12, 13, 14, 15],
  },
  GO: {
    text: "학업성취및전공적합성",
    surveyIds: [8, 9, 10, 11, 12, 13, 14, 15],
  },
  GP: {
    text: "학업수월성",
    surveyIds: [8, 9],
  },
  GQ: {
    text: "학업수행능력",
    surveyIds: [8, 9, 10, 11, 12, 13, 14, 15],
  },
  GR: {
    text: "학업수행역량",
    surveyIds: [8, 9, 10, 11, 12, 13, 14, 15],
  },
  GS: {
    text: "학업역량",
    surveyIds: [8, 9, 10, 11, 12, 13, 14, 15],
  },
  GT: {
    text: "학업역량(기초학업역량)",
    surveyIds: [8, 9, 10, 11, 12, 13, 14, 15],
  },
  GU: {
    text: "학업역량(기초학업역량,학습태도)",
    surveyIds: [8, 9, 10, 11, 12, 13, 14, 15],
  },
  GV: {
    text: "학업역량(성취수준)",
    surveyIds: [8, 9, 10, 11, 12, 13, 14, 15],
  },
  GW: {
    text: "학업역량(자기주도적학업능력)",
    surveyIds: [8, 9, 10, 11, 12, 13, 14, 15],
  },
  GX: {
    text: "학업역량(전공학업역량)",
    surveyIds: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
  },
  GY: {
    text: "학업역량(창의적문제해결력)",
    surveyIds: [8, 9, 10, 11, 12, 13, 14, 15],
  },
  GZ: {
    text: "학업역량(학업성취도)",
    surveyIds: [8, 9, 10, 11, 12, 13, 14, 15],
  },
  HA: {
    text: "학업역량(학업성취도,학업의지와탐구활동)",
    surveyIds: [8, 9, 10, 11, 12, 13, 14, 15],
  },
  HB: {
    text: "학업역량(학업의지와탐구활동)",
    surveyIds: [8, 9, 10, 11, 12, 13, 14, 15],
  },
  HC: {
    text: "학업역량(학업태도)",
    surveyIds: [8, 9, 10, 11, 12, 13, 14, 15],
  },
  HD: {
    text: "학업역량(학업태도와학업의지)",
    surveyIds: [8, 9, 10, 11, 12, 13, 14, 15],
  },
  HE: {
    text: "학업역량(한양대)",
    surveyIds: [8, 9, 10, 11, 12, 13, 14, 15],
  },
  HF: {
    text: "학업역량및전공적합성",
    surveyIds: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
  },
  HG: {
    text: "학업역량및진로(전공)역량",
    surveyIds: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
  },
  HH: {
    text: "학업역량및진로역량",
    surveyIds: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
  },
  HI: {
    text: "학업역량및진로역량[종합평가 Ⅰ]",
    surveyIds: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
  },
  HJ: {
    text: "학업열정.태도",
    surveyIds: [8, 9, 10, 11, 12, 13, 14, 15],
  },
  HK: {
    text: "학업외소양",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28],
  },
  HL: {
    text: "학업의지및달성방안",
    surveyIds: [8, 9, 10, 11, 12],
  },
  HM: {
    text: "학업의지및전공적합성",
    surveyIds: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15],
  },
  HN: {
    text: "학업잠재력",
    surveyIds: [8, 9, 10, 11, 12, 13, 14, 15],
  },
  HO: {
    text: "학업충실성",
    surveyIds: [1, 2, 3, 4, 7, 13, 14, 15],
  },
  HP: {
    text: "학업탐구역량(계열적합성)",
    surveyIds: [13, 14, 15],
  },
  HQ: {
    text: "학업탐구역량(학업성취수준)",
    surveyIds: [8, 9, 10, 11, 12, 13, 14, 15],
  },
  HR: {
    text: "학업태도",
    surveyIds: [10, 11, 12],
  },
  HS: {
    text: "핵심역량",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
  },
  HT: {
    text: "핵심역량(+형협력(R))",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
  },
  HU: {
    text: "핵심역량(인성품성(S))",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28],
  },
  HV: {
    text: "핵심역량(인성품성(S)))",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28],
  },
  HW: {
    text: "핵심역량(자기개발(P))",
    surveyIds: [16, 17, 18, 19, 20, 21, 22, 23, 24, 25],
  },
  HX: {
    text: "활동다양성",
    surveyIds: [13, 14, 15],
  },
  HY: {
    text: "활동실적",
    surveyIds: [29, 30, 31, 32, 33, 34, 35],
  },
  HZ: {
    text: "활동역량",
    surveyIds: [29, 30, 31, 32, 33, 34, 35],
  },
};
